import React from 'react';

const Body = () => (
  <div>
    <h1>大知闲闲，小知间间</h1>
    <h2>Technical Documentation Page</h2>
    <h4>何知闲创作的</h4>
    <h4>Created by Andrew Horn</h4>
    <br />
    <section id="zhuangzi">
      <h3>庄子</h3>
      <p>
        庄子是中国历史上最重要的哲学家。有一些人跟我不同意，但他的
        <code>影响</code>很大，想法也很<code>强</code>。
      </p>
      <p>他最重要的想法包括：</p>
      <ul>
        <li>
          让世界做世界想做的，你自己寂寞地创作<code>自己的天上</code>
        </li>
        <li>
          治国不是一个很<code>值得</code>获得的东西
        </li>
        <li>活着一个谦虚和留在泥里的生活比活着治国的生活好</li>
      </ul>
      <p>最重要的部分包括：</p>
      <ul>
        <li>
          <code>庖丁</code>
        </li>
        <li>
          <code>大王亶父</code>
        </li>
        <li>
          <code>庄子钓鱼两个楚国士来</code>
        </li>
      </ul>
    </section>
    <br />
    <section id="laozi">
      <h3>老子</h3>
      <p>老子是中国哲学历史上最重要女的作者</p>
      <p>他最重要的想法包括：</p>
      <ul>
        <li>上德不德</li>
        <li>有德下德</li>
        <li>不失德</li>
        <li>无德上德</li>
        <li>天下有道却走马以粪</li>
        <li>天下无道戎马生于郊</li>
        <li>故知足之足常足矣</li>
        <li>太上不知有之</li>
        <li>其次亲而誉之</li>
        <li>其次畏之</li>
        <li>其次侮之</li>
        <li>
          百姓皆谓<code>我自然</code>
        </li>
      </ul>
    </section>
    <section id="kongzi">
      <h3>孔子</h3>
      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
    <section id="mengzi">
      <h3>孟子</h3>

      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
    <section id="hanfeizi">
      <h3>韩非子</h3>

      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
    <section id="mozi">
      <h3>墨子</h3>

      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
    <section id="xunzi">
      <h3>荀子</h3>

      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
    <section id="shijiamouni">
      <h3>释迦牟尼</h3>
      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
    <section id="yesu">
      <h3>耶稣</h3>
      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
    <section id="muhanmode">
      <h3>穆罕默德</h3>
      <p>
        甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸</p>
      <p>
        戊己庚辛壬癸甲乙丙丁戊己庚壬癸甲乙丙丁戊己庚辛壬辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
      <p>
        己庚辛壬癸甲乙丙壬癸甲乙丙丁戊己庚辛壬壬癸甲乙丙丁戊己庚辛壬丁戊己庚辛壬癸甲乙丙丁戊己庚辛壬癸
      </p>
    </section>
    <br />
  </div>
);

export default Body;
